main/src/Enums/ВидыРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Планируемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фактический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

main/src/Documents/РасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>РасходДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланируемыеОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасхода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

main/src/CommonForms/ФормаНачальнойСтраницы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок = Метаданные.Синоним;
	
	ИспользуемаяДата = ОбщегоНазначенияСервер.ПолучитьИспользуемуюДату();
	
	ПлановыеРасходыНаТекущийПериод.Параметры.УстановитьЗначениеПараметра("ДатаНачала",
		ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ИспользуемаяДата));
		
	ПлановыеРасходыНаТекущийПериод.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",
		ОбщегоНазначенияКлиентСервер.ПолучитьДатуОкончанияПериода(ИспользуемаяДата));	
	
	ПересчитатьОстатки();	
	
	РассчитатьИтоговуюСуммуПоСпискуДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОстатков" Тогда
		ПересчитатьОстатки();
		РассчитатьИтоговуюСуммуПоСпискуДокументов();
	ИначеЕсли ИмяСобытия = "ИзменениеЛимитаНаПериод" Тогда
		ПересчитатьОстаткиПриИзмененииЛимита();
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФактическийОстатокЛимитаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УчетДенежныхСредствКлиент.ОткрытьФормуСпискаФактическихРасходов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановыйОстатокЛимитаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УчетДенежныхСредствКлиент.ОткрытьФормуСпискаПланируемыхРасходов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеРасходыНаТекущийПериодПослеУдаления(Элемент)
	
	РассчитатьИтоговуюСуммуПоСпискуДокументов();
	Оповестить("ИзменениеОстатков");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьТекущийОстатокДенежныхСредств(Команда)

	ПересчитатьОстатки();	

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПриход(Команда)
	
	ОткрытьФорму("Документ.ПриходДенежныхСредств.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРасход(Команда)
	
	ОткрытьФорму("Документ.РасходДенежныхСредств.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПланируемыйРасход(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидРасхода", ПредопределенноеЗначение("Перечисление.ВидыРасходов.Планируемый"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.РасходДенежныхСредств.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФактическийОстатокЛимита", ФактическийОстатокЛимита);
	
	ОткрытьФорму("ОбщаяФорма.ФормаНастроек", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПересчитатьОстатки()
	
	ТекущийОстатокДенежныхСредств = УчетДенежныхСредствСервер.ПолучитьОстатокДенежныхСредств();
	ФактическийОстатокЛимита = УчетДенежныхСредствСервер.РассчитатьФактическийОстатокЛимитаДенежныхСредствНаПериод();
	ПланируемыеРасходы = УчетДенежныхСредствСервер.ПолучитьПланируемыеРасходыЗаПериод();

	ПлановыйОстатокЛимита = ФактическийОстатокЛимита - ПланируемыеРасходы;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьОстаткиПриИзмененииЛимита()
	
	ФактическийОстатокЛимита = УчетДенежныхСредствСервер.ПолучитьОстатокЛимитаПриИзмененииЛимитаНаПериод();
	ПланируемыеРасходы = УчетДенежныхСредствСервер.ПолучитьПланируемыеРасходыЗаПериод();

	ПлановыйОстатокЛимита = ФактическийОстатокЛимита - ПланируемыеРасходы;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоговуюСуммуПоСпискуДокументов()
	
	МассивВидовРасхода = Новый Массив;
	МассивВидовРасхода.Добавить(Перечисления.ВидыРасходов.Планируемый);
	
	ИспользуемаяДата = ОбщегоНазначенияСервер.ПолучитьИспользуемуюДату();
	ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ИспользуемаяДата);
	ДатаОкончанияПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуОкончанияПериода(ИспользуемаяДата);
		
	ТекстЗапрса =  
		"ВЫБРАТЬ
		|	СУММА(РасходДенежныхСредств.Сумма) КАК Сумма
		|ИЗ
		|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
		|ГДЕ
		|	РасходДенежныхСредств.ВидРасхода В(&МассивВидовРасхода)
		|	И РасходДенежныхСредств.Дата МЕЖДУ &ДатаНачалаПериода И &ДатаОкончанияПериода";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапрса;
	Запрос.УстановитьПараметр("МассивВидовРасхода", МассивВидовРасхода);
	Запрос.УстановитьПараметр("ДатаНачалаПериода", ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецДня(ДатаОкончанияПериода));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ИтоговаяСумма = ВыборкаДетальныеЗаписи.Сумма;
	
	Если ИтоговаяСумма <> 0 Тогда
		Элементы.Декорация1.Заголовок = "План на текущую неделю на сумму " + ИтоговаяСумма;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
